erp3l/src/Catalogs/БланкиОтчетов/БланкиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БланкиОтчетов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>Макет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПоУмолчанию</name>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньТочностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоУмолчаниюВВидеБланка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаскрытиеВМакете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияСлева</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияСверху</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БланкДляОтображения</name>
    <comment>Данный бланк используется только для отображения, так как не содержит всех ключевых реквизитов аналитик</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаШапки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПодвала</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шапка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подвал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСтруктуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияГруппировокСтрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСводнойТаблицы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияГруппировокКолонок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ракурс</name>
    <type>
      <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимБланка</name>
    <comment>0 - Однопериодный бланк, 1- Сводная таблица, 2 - Многопериодный бланк</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Мультиязычный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МакетРаскрытий</name>
    <comment>Содержит ТЧ частей макета для каждой группы раскрытия</comment>
    <attributes>
      <name>КодГруппыРаскрытия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>45</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Макет</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяЧасть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АдресаЭлементовСтруктурыОтчета</name>
    <attributes>
      <name>ТипЭлемента</name>
      <type>
        <types>EnumRef.ЭлементыСтруктурыОтчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.СтрокиОтчетов</types>
        <types>CatalogRef.КолонкиОтчетов</types>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолонкаНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресС1К1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеБланки</name>
    <attributes>
      <name>Бланк</name>
      <type>
        <types>CatalogRef.БланкиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветЗакладки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КартинкаЗакладки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ОбластиДанныхВидовОтчетов/ОбластиДанныхВидовОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбластиДанныхВидовОтчетов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>АналитикаОтбор</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>EnumRef.ТипыАналитикОбластиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики</name>
    <type>
      <types>EnumRef.ТипыАналитикОбластиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласование</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеАналитики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборыАналитки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбработки</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОбластьГруппа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БланкОтображения</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВсеПоказателиВидаОтчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>БланкиДляОтображения</name>
    <attributes>
      <name>Бланк</name>
      <type>
        <types>CatalogRef.БланкиОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставОбласти</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/СтрокиОтчетов/СтрокиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтрокиОтчетов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.ТипыЗначенийПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбработки</name>
    <type>
      <types>EnumRef.СпособыОбработкиПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКурса</name>
    <type>
      <types>EnumRef.ВидыКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидИтога</name>
    <type>
      <types>EnumRef.ВидыИтоговПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоказателя</name>
    <type>
      <types>EnumRef.ВидыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействияПриАктуализации</name>
    <type>
      <types>EnumRef.ДействияПриАктуализацииБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Внутригрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборотный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеМасштабируется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <comment>Наименование на дополнительном языке 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <comment>Наименование на дополнительном языке 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовИРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаПоложительногоОтклонения</name>
    <type>
      <types>EnumRef.ВидыОценокОтклонений</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммироватьПодчиненные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетБД</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияРесурсов</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРаскрытия</name>
    <type>
      <types>CatalogRef.ГруппыРаскрытия</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделениеПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НормализованныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодавлятьИерархиюПоПериодам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСправочникаБД</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/БланкиОтчетов/Forms/ФормаНастройкиСтрок/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Бланк = Параметры.Бланк;
	ВидОтчета = Параметры.Владелец;
	ЗаполнитьДеревоСтрок(ВидОтчета,Параметры.Бланк);
	ЗаполнитьДеревоВыбранныхСтрок(Параметры.Бланк);
	
	Элементы.ГруппаКомандыПереноса.Доступность = Бланк.Ракурс = Справочники.ОбластиДанныхВидовОтчетов.ПустаяСсылка();
	Элементы.ГруппаДоступныеПоказатели.Доступность  = Бланк.Ракурс = Справочники.ОбластиДанныхВидовОтчетов.ПустаяСсылка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИзменения(Команда)
	
	ПрименитьИзмененияСервер();
	Закрыть(Новый Структура("Изменено",Истина));
		
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИзменения(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПеренестиВправо(Команда)
	
	МассивПереносимыхСтрок = Новый Массив;
	МассивУдаляемыхСтрок = Новый Массив;
	МассивИндексируемыхСтрок = Новый Массив;
		
	Если Элементы.ДеревоВыбранныхСтрок.ВыделенныеСтроки.Количество()=1 Тогда
		Если Элементы.ДеревоВыбранныхСтрок.ВыделенныеСтроки[0]=0 Тогда
			 Возврат  
		КонецЕсли;			
	КонецЕсли;	
	
	Для Каждого  индСтроки Из Элементы.ДеревоВыбранныхСтрок.ВыделенныеСтроки Цикл
		
		Строка = ДеревоВыбранныхСтрок.НайтиПоИдентификатору(индСтроки);	
		МассивПереносимыхСтрок.Добавить(Строка);
		МассивУдаляемыхСтрок.Добавить(индСтроки);
		УдаленныеСтроки.Добавить(Строка.Строка);
		
		тРодитель = Строка.ПолучитьРодителя();
		Если Не тРодитель = Неопределено Тогда
			МассивИндексируемыхСтрок.Добавить(Строка.ПолучитьРодителя());
		Иначе	
			МассивИндексируемыхСтрок.Добавить(Строка);
		КонецЕсли;
			
	КонецЦикла;	
	
	ПеренестиСтрокиВДоступные(МассивПереносимыхСтрок);
	
	Для Каждого индСтроки Из МассивУдаляемыхСтрок Цикл
		
		НужнаяСтрока = ДеревоВыбранныхСтрок.НайтиПоИдентификатору(индСтроки);
		
		Если НЕ НужнаяСтрока = Неопределено Тогда
			
			тРодитель = НужнаяСтрока.ПолучитьРодителя();
			Если Не тРодитель = Неопределено Тогда
				НужнаяСтрока.ПолучитьРодителя().ПолучитьЭлементы().Удалить(НужнаяСтрока);
			Иначе	
				ДеревоВыбранныхСтрок.ПолучитьЭлементы().Удалить(НужнаяСтрока);
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЦикла;	
		
	Для каждого Стр Из МассивИндексируемыхСтрок Цикл
	
		Если  Стр.ПолучитьЭлементы().Количество() =0 Тогда
			  Стр.ЭтоЭлементГруппа=Ложь;
			  Стр.Изменена = Истина;
		КонецЕсли;	
		ПроиндексироватьСтроки(Стр);

	КонецЦикла; 
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВлево(Команда,СтрокаРодитель = Неопределено)
	
	ЕстьПодчиненные = Ложь;
	МассивПереносимыхСтрок = Новый Массив;
	
	Для Каждого  индСтроки Из Элементы.ДеревоНастройки.ВыделенныеСтроки Цикл
		
		Строка = ДеревоНастройки.НайтиПоИдентификатору(индСтроки);	
		Если Строка.СтрокаИспользована Тогда
			 Продолжить;
		КонецЕсли;
		
		Если Строка.ПолучитьЭлементы().Количество()>0 Тогда
			 ЕстьПодчиненные = Истина;	
		КонецЕсли;	
		
		МассивПереносимыхСтрок.Добавить(Строка);
		
	КонецЦикла;	

	Если СтрокаРодитель = Неопределено Тогда
		
		индСтрокаРодитель = Элементы.ДеревоВыбранныхСтрок.ВыделенныеСтроки[0];
		СтрокаРодитель =  ДеревоВыбранныхСтрок.НайтиПоИдентификатору(индСтрокаРодитель);
		
		
		//МассивПереносимыхСтрок.Очистить();
		//Для Каждого  индСтроки Из индСтрокаРодитель.ПолучитьЭлементы() Цикл
		//	МассивПереносимыхСтрок.Добавить(Строка);
		//КонецЦикла;
		
	КонецЕсли;	
	
	ДопПараметры = Новый Структура("СтрокаРодитель,МассивПереносимыхСтрок",СтрокаРодитель,МассивПереносимыхСтрок);
	
	Если  ЕстьПодчиненные Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемЗавершение",ЭтаФорма,ДопПараметры);
		ПоказатьВопрос(Оповещение, Нстр("ru = 'Перенести подчиненные элементы?'"), РежимДиалогаВопрос.ДаНет);
		
	Иначе	
		
		Для Каждого Стр Из МассивПереносимыхСтрок Цикл   	
			
			Нстр = СтрокаРодитель.ПолучитьЭлементы().Добавить();
			Нстр.Наименование 	 = Строка(Стр.Строка);
			Нстр.СтрокаОтчета 	 = Стр.Строка;
			Нстр.Изменена 		 = Истина;
			Нстр.ПорядковыйНомер = СтрокаРодитель.ПолучитьЭлементы().Количество()-1; 
			Нстр.ГруппаРаскрытия = Стр.ГруппаРаскрытия;
			Нстр.Код 			 = Стр.Код;
			
			Если НЕ  СтрокаРодитель.Наименование = Нстр("ru = 'Выбранные строки'") Тогда
				СтрокаРодитель.ЭтоЭлементГруппа = Истина;
				СтрокаРодитель.Изменена = Истина;
			КонецЕсли;
			//ДобавитьНовыеСтрокиРекурсивно(ИсходныйРодитель,Стр);   
			
		КонецЦикла;
		
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьВниз(Команда)
	
	ИзменитьКодСтроки(1);

КонецПроцедуры

&НаКлиенте
Процедура СдвинутьВверх(Команда)
	
	ИзменитьКодСтроки(-1);

КонецПроцедуры
	
&НаКлиенте
Процедура СвернутьУровниДоступные(Команда)
	
	ТекМассив = ДеревоНастройки.НайтиПоИдентификатору(0).ПолучитьЭлементы();
	Для Каждого Эл Из ТекМассив Цикл
		
		Элементы.ДеревоНастройки.Свернуть(Эл.ПолучитьИдентификатор());
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(Элемент,Знач ТекущийУзел) Экспорт
	
	ТекМассив = ТекущийУзел.ПолучитьЭлементы();
	Для Каждого Эл Из ТекМассив Цикл
		
		Элемент.Свернуть(Эл.ПолучитьИдентификатор());
		СвернутьДерево(Элемент,Эл);
		
	КонецЦикла;
		
КонецПроцедуры 

&НаКлиенте
Процедура РазвернутьУровниДоступные(Команда)
		
	Элементы.ДеревоНастройки.Развернуть(0,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьУровниВыбранные(Команда)
	
	Элементы.ДеревоВыбранныхСтрок.Развернуть(0,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьУровниВыбранные(Команда)
	
	ТекМассив = ДеревоВыбранныхСтрок.НайтиПоИдентификатору(0).ПолучитьЭлементы();
	
	Для Каждого Эл Из ТекМассив Цикл
		
		Элементы.ДеревоВыбранныхСтрок.Свернуть(Эл.ПолучитьИдентификатор());
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбранныхСтрокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбранныхСтрокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастройкиНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		
		МассивОтвета = Новый Массив;                           
		
		Для Каждого Ид_Элемент Из ПараметрыПеретаскивания.Значение Цикл			
			МассивОтвета.Добавить(Ид_Элемент);
		КонецЦикла;
		
		ПараметрыПеретаскивания.ДопустимыеДействия 	= ДопустимыеДействияПеретаскивания.Копирование;
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;	
		ПараметрыПеретаскивания.Значение = Новый Структура("Источник,Строки", "Доступные",МассивОтвета);
		                       
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбранныхСтрокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбранныхСтрокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	ЕстьПодчиненные = Ложь;
	МассивПереносимыхСтрок = Новый Массив;
	
	Если Строка = Неопределено Тогда	
		СтрокаРодитель = ДеревоВыбранныхСтрок.НайтиПоИдентификатору(0);	
	Иначе
		СтрокаРодитель = ДеревоВыбранныхСтрок.НайтиПоИдентификатору(Строка);	
	КонецЕсли;
	
	
	Если  ПараметрыПеретаскивания.Значение.Источник = "Выбранные" Тогда
					
			Для Каждого эМассив Из ПараметрыПеретаскивания.Значение.Строки Цикл
				
				ПереноисмаяСтрока = ДеревоВыбранныхСтрок.НайтиПоИдентификатору(эМассив);	
				
				Если СтрокаРодитель = ПереноисмаяСтрока.ПолучитьРодителя() Тогда
					 Продолжить;
				КонецЕсли;	
				
				Если ПереноисмаяСтрока.ПолучитьЭлементы().Количество()>0 Тогда
					ЕстьПодчиненные = Истина;	
				КонецЕсли;	
				
				ИсходныйРодитель = ПереноисмаяСтрока.ПолучитьРодителя();
				
				МассивПереносимыхСтрок.Добавить(эМассив);
				
				Нстр = СтрокаРодитель.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(Нстр,ПереноисмаяСтрока);
				Нстр.Изменена = Истина;
				Нстр.ПорядковыйНомер = СтрокаРодитель.ПолучитьЭлементы().Количество()-1; 
				СтрокаРодитель.ЭтоЭлементГруппа = Истина;
				
				Если НЕ  СтрокаРодитель.Наименование = Нстр("ru = 'Выбранные строки'") Тогда
					СтрокаРодитель.ЭтоЭлементГруппа = Истина;
					СтрокаРодитель.Изменена = Истина;
				КонецЕсли;

				
												
				Если  ЕстьПодчиненные Тогда
					
					ПеренестиСПодчиненными(ПереноисмаяСтрока,Нстр);
					  
				КонецЕсли; 

				Для Каждого индСтроки Из МассивПереносимыхСтрок Цикл
					
					НужнаяСтрока = ДеревоВыбранныхСтрок.НайтиПоИдентификатору(индСтроки);
					
					Если НЕ НужнаяСтрока = Неопределено Тогда
						
						тРодитель = ПереноисмаяСтрока.ПолучитьРодителя();
						Если Не тРодитель = Неопределено Тогда
							ПереноисмаяСтрока.ПолучитьРодителя().ПолучитьЭлементы().Удалить(ПереноисмаяСтрока);
						Иначе	
							ДеревоВыбранныхСтрок.ПолучитьЭлементы().Удалить(ПереноисмаяСтрока);
						КонецЕсли;
						
						Если  тРодитель.ПолучитьЭлементы().Количество() = 0 Тогда
							тРодитель.ЭтоЭлементГруппа = Ложь;							
							Если НЕ  тРодитель.Наименование = Нстр("ru = 'Выбранные строки'") Тогда
								тРодитель.ЭтоЭлементГруппа = Ложь;
								тРодитель.Изменена = Истина;
							КонецЕсли;
							
						КонецЕсли;	
						
					КонецЕсли;
					
				КонецЦикла;	
					
				ПроиндексироватьСтроки(ИсходныйРодитель);

				
			КонецЦикла;
			
		ИначеЕсли ПараметрыПеретаскивания.Значение.Источник = "Доступные" Тогда 	
		
			ПеренестиВлево(Неопределено,СтрокаРодитель);
			
		КонецЕсли;
		
	Возврат;

КонецПроцедуры



&НаКлиенте
Процедура ДеревоВыбранныхСтрокНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		
		МассивОтвета = Новый Массив;                           
		
		Для Каждого Ид_Элемент Из ПараметрыПеретаскивания.Значение Цикл			
			МассивОтвета.Добавить(Ид_Элемент);
		КонецЦикла;
		
		ПараметрыПеретаскивания.ДопустимыеДействия 	= ДопустимыеДействияПеретаскивания.Перемещение;
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;	
		ПараметрыПеретаскивания.Значение = Новый Структура("Источник,Строки", "Выбранные",МассивОтвета);
		                       
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьДеревоСтрок(ВидОтчета,Бланк)
	
	ДеревоНастройкиСервер=РеквизитФормыВЗначение("ДеревоНастройки");
	ДеревоНастройкиСервер.Строки.Очистить();
	
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	СтрокиОтчетов.ПорядковыйНомер КАК ПорядковыйНомер,
	             |	СтрокаКолонка.Строка,
	             |	СтрокаКолонка.Код,
	             |	СтрокаКолонка.Наименование,
	             |	СтрокаКолонка.ГруппаРаскрытия,
	             |	СтрокаКолонка.ГруппаРаскрытия.ВидАналитики1 КАК ВидАналитики1,
	             |	СтрокаКолонка.ГруппаРаскрытия.ВидАналитики2 КАК ВидАналитики2,
	             |	СтрокаКолонка.ГруппаРаскрытия.ВидАналитики3 КАК ВидАналитики3,
	             |	СтрокаКолонка.ГруппаРаскрытия.ВидАналитики4 КАК ВидАналитики4,
	             |	СтрокаКолонка.ГруппаРаскрытия.ВидАналитики5 КАК ВидАналитики5,
				 |	СтрокаКолонка.ГруппаРаскрытия.ВидАналитики6 КАК ВидАналитики6,
				 |	СтрокаКолонка.ВидИтога,
	             |	СтрокаКолонка.ТипЗначения,
	             |	СтрокаКолонка.Родитель,
	             |	СтрокиОтчетов.СуммироватьПодчиненные,
	             |	СтрокаКолонка.СпособОбработки,
	             |	СтрокаКолонка.ВидКурса,
	             |	СтрокаКолонка.ВидПоказателя,
	             |	СтрокаКолонка.ДействияПриАктуализации,
	             |	СтрокаКолонка.Внутригрупповой,
	             |	СтрокаКолонка.Оборотный,
	             |	СтрокаКолонка.НеМасштабируется,
	             |	СтрокаКолонка.Наименование1,
	             |	СтрокаКолонка.Наименование2,
	             |	СтрокаКолонка.ПриходРасход,
	             |	СтрокаКолонка.ОценкаПоложительногоОтклонения,
	             |	СтрокаКолонка.СтатьяБюджета,
	             |	СтрокаКолонка.Предназначение,
	             |	СтрокаКолонка.РазделениеПоПроектам,
	             |	ВЫБОР КОГДА СтрокиСтруктуры.Ссылка IS NULL ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК СтрокаИспользована
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		СтрокиОтчетов.Ссылка КАК Строка,
	             |		СтрокиОтчетов.Код КАК Код,
	             |		СтрокиОтчетов.Наименование КАК Наименование,
	             |		СтрокиОтчетов.ГруппаРаскрытия КАК ГруппаРаскрытия,
	             |		СтрокиОтчетов.ПорядковыйНомер КАК ПорядковыйНомер,
	             |		СтрокиОтчетов.ВидИтога КАК ВидИтога,
	             |		СтрокиОтчетов.ТипЗначения КАК ТипЗначения,
	             |		СтрокиОтчетов.Родитель КАК Родитель,
	             |		СтрокиОтчетов.СпособОбработки КАК СпособОбработки,
	             |		СтрокиОтчетов.ВидКурса КАК ВидКурса,
	             |		СтрокиОтчетов.ВидПоказателя КАК ВидПоказателя,
	             |		СтрокиОтчетов.ДействияПриАктуализации КАК ДействияПриАктуализации,
	             |		СтрокиОтчетов.Внутригрупповой КАК Внутригрупповой,
	             |		СтрокиОтчетов.Оборотный КАК Оборотный,
	             |		СтрокиОтчетов.НеМасштабируется КАК НеМасштабируется,
	             |		СтрокиОтчетов.Наименование1 КАК Наименование1,
	             |		СтрокиОтчетов.Наименование2 КАК Наименование2,
	             |		СтрокиОтчетов.ПриходРасход КАК ПриходРасход,
	             |		ВЫБОР
	             |			КОГДА СтрокиОтчетов.Предназначение = ЗНАЧЕНИЕ(Перечисление.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияДенежныхСредств)
	             |				ТОГДА СтрокиОтчетов.СтатьяДвиженияДенежныхСредств
	             |			КОГДА СтрокиОтчетов.Предназначение = ЗНАЧЕНИЕ(Перечисление.ПредназначенияЭлементовСтруктурыОтчета.БюджетДоходовИРасходов)
	             |				ТОГДА СтрокиОтчетов.СтатьяДоходовИРасходов
	             |			КОГДА СтрокиОтчетов.Предназначение = ЗНАЧЕНИЕ(Перечисление.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияРесурсов)
	             |				ТОГДА СтрокиОтчетов.СтатьяДвиженияРесурсов
	             |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	             |		КОНЕЦ КАК СтатьяБюджета,
	             |		СтрокиОтчетов.ОценкаПоложительногоОтклонения КАК ОценкаПоложительногоОтклонения,
	             |		ВЫБОР
	             |			КОГДА СтрокиОтчетов.Предназначение = ЗНАЧЕНИЕ(Перечисление.ПредназначенияЭлементовСтруктурыОтчета.ПустаяСсылка)
	             |				ТОГДА ЗНАЧЕНИЕ(Перечисление.ПредназначенияЭлементовСтруктурыОтчета.ПроизвольныеДанные)
	             |			ИНАЧЕ СтрокиОтчетов.Предназначение
	             |		КОНЕЦ КАК Предназначение,
	             |		СтрокиОтчетов.РазделениеПоПроектам КАК РазделениеПоПроектам
	             |	ИЗ
	             |		Справочник.СтрокиОтчетов КАК СтрокиОтчетов
	             |	ГДЕ
	             |		СтрокиОтчетов.Владелец = &ВидОтчета
	             |		И НЕ СтрокиОтчетов.ПометкаУдаления) КАК СтрокаКолонка
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтрокиОтчетов КАК СтрокиОтчетов
	             |		ПО СтрокаКолонка.Строка = СтрокиОтчетов.Ссылка
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиСтруктурыБланка КАК СтрокиСтруктуры
	             |		ПО СтрокаКолонка.Строка = СтрокиСтруктуры.СтрокаОтчета
	             |			И (СтрокиСтруктуры.Владелец = &Бланк)
	             |ГДЕ
	             |	СтрокиОтчетов.Владелец = &ВидОтчета
	             |	И НЕ СтрокиОтчетов.ПометкаУдаления
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ПорядковыйНомер ИЕРАРХИЯ";
				 
	Запрос.УстановитьПараметр("ВидОтчета",ВидОтчета);
	Запрос.УстановитьПараметр("Бланк",Бланк);

	
	ВыводимаяСтрокаОтчета=Справочники.СтрокиОтчетов.ПустаяСсылка();
	ТекущаяСтрокаДерева=Неопределено;
	
	Результат=Запрос.Выполнить().Выбрать();
	
	СоответствиеСтрок=Новый Соответствие;
	СоответствиеРодителей=Новый Соответствие;
	
	СписокАналитик=Новый Массив;
	
	ЕстьСтрокиБюджетов=Ложь;
	
	ДеревоНастройкиСервер_Строки = ДеревоНастройкиСервер.Строки.Добавить();
	ДеревоНастройкиСервер_Строки.Наименование = Нстр("ru = 'Доступные строки'");
	
	
	Пока Результат.Следующий() Цикл
		
		Если Результат.Строка<>ВыводимаяСтрокаОтчета Тогда
			
			ТекущаяСтрокаДерева=СоответствиеСтрок[Результат.Строка];
			
			Если ТекущаяСтрокаДерева=Неопределено Тогда
				
				Если Результат.Родитель=Справочники.СтрокиОтчетов.ПустаяСсылка() Тогда
					
					ТекущаяСтрокаДерева=ДеревоНастройкиСервер_Строки.Строки.Добавить();
					
				Иначе
					
					СтрокаРодитель=СоответствиеРодителей[Результат.Родитель];
					
					Если СтрокаРодитель=Неопределено Тогда
												
						СтрокаРодитель=ДеревоНастройкиСервер.Строки.Найти(Результат.Родитель,"Строка",Истина);
						СоответствиеРодителей.Вставить(Результат.Родитель,СтрокаРодитель);
						
					КонецЕсли;
					
					ТекущаяСтрокаДерева=СтрокаРодитель.Строки.Добавить();
					
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(ТекущаяСтрокаДерева,Результат);
				ТекущаяСтрокаДерева.Код=СокрЛП(Результат.Код);
				СоответствиеСтрок.Вставить(Результат.Строка,ТекущаяСтрокаДерева);
				
			КонецЕсли;
			
			ВыводимаяСтрокаОтчета=Результат.Строка;
			
		КонецЕсли;
				
		Для Индекс=1 ПО ПараметрыСеанса.ЧислоДопАналитик Цикл
			
			Если ЗначениеЗаполнено(ТекущаяСтрокаДерева["ВидАналитики"+Индекс]) И СписокАналитик.Найти("ДеревоНастройкиСтруктурыВидАналитики"+Индекс)=Неопределено Тогда
				
				СписокАналитик.Добавить("ДеревоНастройкиСтруктурыВидАналитики"+Индекс);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТекущаяСтрокаДерева.Предназначение=Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияДенежныхСредств
			ИЛИ ТекущаяСтрокаДерева.Предназначение=Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДоходовИРасходов
			ИЛИ ТекущаяСтрокаДерева.Предназначение=Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияРесурсов Тогда
			
			ЕстьСтрокиБюджетов=Истина;
			
		КонецЕсли;

	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоНастройкиСервер,"ДеревоНастройки");	
				
КонецПроцедуры // ЗаполнитьДеревоСтрок()

&НаСервере
Процедура ЗаполнитьДеревоВыбранныхСтрок(Бланк)
	
	ДеревоНастройкиСервер=РеквизитФормыВЗначение("ДеревоВыбранныхСтрок");
	
	ВыводимаяСтрокаОтчета=Справочники.НастройкиСтруктурыБланка.ПустаяСсылка();

	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	НастройкиСтруктурыБланка.Ссылка КАК Строка,
	             |	НастройкиСтруктурыБланка.СтрокаОтчета,
	             |	НастройкиСтруктурыБланка.Родитель,
	             |	НастройкиСтруктурыБланка.СтрокаОтчета.Наименование КАК Наименование,
	             |	НастройкиСтруктурыБланка.СтрокаОтчета.Код КАК Код,
	             |	НастройкиСтруктурыБланка.ПорядковыйНомер,
	             |	НастройкиСтруктурыБланка.Уровень,
	             |	НастройкиСтруктурыБланка.ЭтоЭлементГруппа,
	             |	НастройкиСтруктурыБланка.СтрокаОтчета.ГруппаРаскрытия КАК ГруппаРаскрытия,
				 |	НастройкиСтруктурыБланка.СтрокаОтчета.Владелец КАК ВидОтчета 
	             |ИЗ
	             |	Справочник.НастройкиСтруктурыБланка КАК НастройкиСтруктурыБланка
	             |ГДЕ
	             |	НастройкиСтруктурыБланка.Владелец = &Владелец
	             |	И НастройкиСтруктурыБланка.ИндексЭлемента = 2
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	НастройкиСтруктурыБланка.ПорядковыйНомер ИЕРАРХИЯ";
				 
	Запрос.УстановитьПараметр("Владелец",Бланк);
	
	ТекущаяСтрокаДерева=Неопределено;
	
	Результат=Запрос.Выполнить().Выбрать();
	
	СоответствиеСтрок=Новый Соответствие;
	СоответствиеРодителей=Новый Соответствие;
	
	СписокАналитик=Новый Массив;
	
	ЕстьСтрокиБюджетов=Ложь;
	
	ДеревоНастройкиСервер_Строки = ДеревоНастройкиСервер.Строки.Добавить();
	ДеревоНастройкиСервер_Строки.Наименование = Нстр("ru = 'Выбранные строки'");
	
	Пока Результат.Следующий() Цикл
		
		Если Результат.Строка<>ВыводимаяСтрокаОтчета Тогда
			
			ТекущаяСтрокаДерева=СоответствиеСтрок[Результат.Строка];
			
			Если ТекущаяСтрокаДерева=Неопределено Тогда
				
				Если Результат.Родитель=Справочники.НастройкиСтруктурыБланка.ПустаяСсылка() Тогда
					
					ТекущаяСтрокаДерева=ДеревоНастройкиСервер_Строки.Строки.Добавить();
					
				Иначе
					
					СтрокаРодитель=СоответствиеРодителей[Результат.Родитель];
					
					Если СтрокаРодитель=Неопределено Тогда
												
						СтрокаРодитель=ДеревоНастройкиСервер.Строки.Найти(Результат.Родитель,"Строка",Истина);
						СоответствиеРодителей.Вставить(Результат.Родитель,СтрокаРодитель);
						
					КонецЕсли;
					
					ТекущаяСтрокаДерева=СтрокаРодитель.Строки.Добавить();
					
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(ТекущаяСтрокаДерева,Результат);
				ТекущаяСтрокаДерева.Код=СокрЛП(Результат.Код);
				СоответствиеСтрок.Вставить(Результат.Строка,ТекущаяСтрокаДерева);
				
			КонецЕсли;
			
			ВыводимаяСтрокаОтчета=Результат.Строка;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоНастройкиСервер,"ДеревоВыбранныхСтрок");	
				
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Для Каждого Стр Из ДополнительныеПараметры.МассивПереносимыхСтрок Цикл
			
			Если Стр.Наименование = Нстр("ru = 'Доступные строки'") Тогда
				 Нстр = ДополнительныеПараметры.СтрокаРодитель;
				 ДобавитьНовыеСтрокиРекурсивно(Нстр,Стр);
                 Возврат;
			КонецЕсли;	
			
			Нстр = ДополнительныеПараметры.СтрокаРодитель.ПолучитьЭлементы().Добавить();
			Нстр.Наименование = Строка(Стр.Строка);
			Нстр.СтрокаОтчета = Стр.Строка;
			Нстр.Изменена = Истина;
			Нстр.ПорядковыйНомер = ДополнительныеПараметры.СтрокаРодитель.ПолучитьЭлементы().Количество()-1;
			Нстр.ГруппаРаскрытия = Стр.ГруппаРаскрытия;
			Нстр.Код 			 = Стр.Код;

			ДополнительныеПараметры.СтрокаРодитель.ЭтоЭлементГруппа = Истина;
			
			Если НЕ  ДополнительныеПараметры.СтрокаРодитель.Наименование = Нстр("ru = 'Выбранные строки'") Тогда
				ДополнительныеПараметры.СтрокаРодитель.ЭтоЭлементГруппа = Истина;
				ДополнительныеПараметры.СтрокаРодитель.Изменена = Истина;
			КонецЕсли;
			
			
			ДобавитьНовыеСтрокиРекурсивно(Нстр,Стр);
			
		КонецЦикла;
		
	Иначе	
		
		Для Каждого Стр Из ДополнительныеПараметры.МассивПереносимыхСтрок Цикл   	
			
			Если Стр.Наименование = Нстр("ru = 'Доступные строки'") Тогда
                 Возврат;
			КонецЕсли;	

			Нстр = ДополнительныеПараметры.СтрокаРодитель.ПолучитьЭлементы().Добавить();
			Нстр.Наименование = Строка(Стр.Строка);
			Нстр.СтрокаОтчета = Стр.Строка;
			Нстр.Изменена = Истина;
			Нстр.ПорядковыйНомер = ДополнительныеПараметры.СтрокаРодитель.ПолучитьЭлементы().Количество()-1;
			Если НЕ  ДополнительныеПараметры.СтрокаРодитель.Наименование = Нстр("ru = 'Выбранные строки'") Тогда
				ДополнительныеПараметры.СтрокаРодитель.ЭтоЭлементГруппа = Истина;
				ДополнительныеПараметры.СтрокаРодитель.Изменена = Истина;
			КонецЕсли;


			//ДобавитьНовыеСтрокиРекурсивно(ИсходныйРодитель,Стр);   
			
		КонецЦикла;
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиСтрокиВДоступные(МассивПереносимыхСтрок)
			
	Для Каждого Стр Из МассивПереносимыхСтрок Цикл
		
		ПометитьДоступныеСтроки(ДеревоНастройки,Стр.СтрокаОтчета);
		УдаленныеСтроки.Добавить(Стр.Строка);
				
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПометитьДоступныеСтроки(ТекСтрока,СтрокаОтчета)

	   ТекМассив = ТекСтрока.ПолучитьЭлементы();
       Для каждого Эл Из ТекМассив Цикл
	       Если  Эл.Строка = СтрокаОтчета Тогда
		        Эл.СтрокаИспользована = Ложь;
				Возврат;
		   Иначе 
			   ПометитьДоступныеСтроки(Эл,СтрокаОтчета);
		   КонецЕсли;  
	   КонецЦикла; 	   
	   
 КонецПроцедуры
 
&НаКлиенте
Процедура ПеренестиСтрокиВДоступныеРекурсивно(СтрокаРодитель)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыеСтрокиРекурсивно(ЭлементыДерева,индСтроки)
	
	Для Каждого Эл Из индСтроки.ПолучитьЭлементы() Цикл
		
		//Если Не Эл.СтрокаИспользована Тогда
			
			Нстр = ЭлементыДерева.ПолучитьЭлементы().Добавить();
			Нстр.Наименование = Строка(Эл.Строка);
			Нстр.СтрокаОтчета = Эл.Строка;
			Нстр.Изменена = Истина;
			Нстр.ПорядковыйНомер = ЭлементыДерева.ПолучитьЭлементы().Количество()-1;
			ЭлементыДерева.ЭтоЭлементГруппа = Истина;
			ДобавитьНовыеСтрокиРекурсивно(Нстр,Эл);
			
		//КонецЕсли;
		
	КонецЦикла; 
		
КонецПроцедуры
	
&НаСервере
Процедура ПрименитьИзмененияСервер()
	
	Для Каждого Стр Из УдаленныеСтроки Цикл
		
		Если Не ЗначениеЗаполнено(Стр.Значение) Тогда
			 Продолжить;
		КонецЕсли;	
		
		оСтр = Стр.Значение.ПолучитьОбъект();
		Если Не оСтр = Неопределено Тогда	
			оСтр.Удалить();
		КонецЕсли;
	КонецЦикла;	
			
	ДеревоВыбранныхСтрок_ = РеквизитФормыВЗначение("ДеревоВыбранныхСтрок");
	
	ИзмененныеСтроки = ДеревоВыбранныхСтрок_.Строки.НайтиСтроки(Новый Структура("Изменена",Истина),Истина);
	
	Для Каждого Стр Из ИзмененныеСтроки Цикл

		Если Стр.Наименование = Нстр("ru = 'Выбранные строки'") Тогда
			  Продолжить;
		КонецЕсли;	
		
		Если  ЗначениеЗаполнено(Стр.Строка) Тогда
			 оСтр = Стр.Строка.ПолучитьОбъект();
			 Если НЕ оСтр = Неопределено Тогда 
				 оСтр.ПорядковыйНомер = Стр.ПорядковыйНомер;
				 оСтр.Родитель = Стр.Родитель.Строка;
				 оСтр.Уровень =  Стр.Уровень()-1;
				 оСтр.ЭтоЭлементГруппа = Стр.ЭтоЭлементГруппа;
				 оСтр.Записать(); 
			 КонецЕсли;
		 Иначе	 
			 оСтр = Справочники.НастройкиСтруктурыБланка.СоздатьЭлемент();
			 оСтр.ПорядковыйНомер = Стр.ПорядковыйНомер;
			 оСтр.Родитель = Стр.Родитель.Строка;
			 оСтр.Наименование = Стр.Наименование;
			 оСтр.Код = Стр.Код;
			 оСтр.СтрокаОтчета = Стр.СтрокаОтчета;
			 оСтр.ИндексЭлемента = 2;
			 оСтр.Владелец = Бланк;
			 оСтр.Уровень =  Стр.Уровень()-1;
			 оСтр.ЭтоЭлементГруппа = Стр.ЭтоЭлементГруппа;
			 оСтр.Записать();
			 Стр.Строка = оСтр.Ссылка;
             СводнаяТаблицаУХ.СоздатьНастройкуПоказателя(Бланк,оСтр.Ссылка)			 	 
		КонецЕсли;				
	КонецЦикла;	
		
	ОбновитьПорядковыеНомера();
	
КонецПроцедуры	

&НаКлиенте
Процедура ИзменитьКодСтроки(Направление)
	
	индСтроки = Элементы.ДеревоВыбранныхСтрок.ТекущаяСтрока;
	ТекДанные = Элементы.ДеревоВыбранныхСтрок.ТекущиеДанные;
	НужнаяСтрока = ДеревоВыбранныхСтрок.НайтиПоИдентификатору(индСтроки);
	ПорядковыйНомер = ТекДанные.ПорядковыйНомер;	
	
	тРодитель = НужнаяСтрока.ПолучитьРодителя();

	Если Не тРодитель = Неопределено Тогда
		ТекМассив = НужнаяСтрока.ПолучитьРодителя().ПолучитьЭлементы();
	Иначе	
		ТекМассив = ДеревоВыбранныхСтрок.ПолучитьЭлементы();
	КонецЕсли;

	Если Направление = 1 Тогда
		
		Если ПорядковыйНомер = ТекМассив.Количество()-1 Тогда
			 Возврат;
			 ЦелеваяСтрока = ТекМассив[0];
			 Направление = -1*ПорядковыйНомер;
		Иначе	
			 ЦелеваяСтрока = ТекМассив[ПорядковыйНомер+Направление];
		КонецЕсли;
		
	КонецЕсли;	
	
	Если Направление = -1 Тогда
		
		Если ПорядковыйНомер = 0 Тогда
			 Возврат;
			 ЦелеваяСтрока = ТекМассив[0];
			 Направление = -1*ПорядковыйНомер;
		Иначе	
			 ЦелеваяСтрока = ТекМассив[ПорядковыйНомер+Направление];
		КонецЕсли;
		
	КонецЕсли;	

	
	НПП = ТекДанные.ПорядковыйНомер;	
	ТекДанные.ПорядковыйНомер = ЦелеваяСтрока.ПорядковыйНомер;
	ЦелеваяСтрока.ПорядковыйНомер = НПП;
	
	ТекМассив.Сдвинуть(НПП,Направление);
	
	ТекДанные.Изменена = Истина;
	ЦелеваяСтрока.Изменена = Истина;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроиндексироватьСтроки(СтрокаРодитель)

	Инд = 0;
	Для каждого Эл Из СтрокаРодитель.ПолучитьЭлементы() Цикл
		
		Эл.ПорядковыйНомер = Инд;
		Эл.Изменена = Истина;
		Инд = Инд+1;
		
	КонецЦикла; 


КонецПроцедуры
 
&НаКлиенте
Процедура ПеренестиСПодчиненными(индСтроки,ЭлементыДерева)
	
	Для каждого Эл Из индСтроки.ПолучитьЭлементы() Цикл
		
		Нстр = ЭлементыДерева.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(Нстр,Эл);

		Нстр.Изменена = Истина;
		Нстр.ПорядковыйНомер = Эл.ПорядковыйНомер;
		
		ДобавитьНовыеСтрокиРекурсивно(Нстр,Эл);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиДоступныеСПодчиненными(индСтроки,ЭлементыДерева)
	
	Для каждого Эл Из индСтроки.ПолучитьЭлементы() Цикл
		
		Нстр = ЭлементыДерева.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(Нстр,Эл);

		Нстр.Изменена = Истина;
		Нстр.ПорядковыйНомер = Эл.ПорядковыйНомер;
		
		ДобавитьНовыеСтрокиРекурсивно(Нстр,Эл);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовуюСтрокуВО(Команда)
	
	Параметры_ = Новый Структура("Бланк",Бланк);
	
	//Оповещение = Новый ОписаниеОповещения("НастрйкаОсейЗавершение", ЭтаФорма);
	
	ОткрытьФорму("Справочник.БланкиОтчетов.Форма.МастерСозданияНовыхСтрок", 
	Параметры_,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетаПриИзменении(Элемент)
	ЗаполнитьДеревоСтрок(ВидОтчета,Бланк);
КонецПроцедуры

&НаСервере
Процедура ОбновитьПорядковыеНомера()
		 		
	СводнаяТаблицаУХ.ОбновитьПорядокСтрокБланкаСТ(Бланк);
  
КонецПроцедуры
